In [3]:
import pandas as pd

# 예제 2-15 논리식 검색

In [4]:
sat = pd.read_csv("../data/2014_korea_sat_scores.csv",encoding = 'euc-kr').dropna(axis=1)

In [5]:
type(sat)

pandas.core.frame.DataFrame

In [6]:
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [7]:
sat.shape

(342, 5)

In [8]:
sat['도수(명)'].dtype

dtype('int64')

In [9]:
import numpy as np

In [10]:
sat['도수(명)']

0      13866
1      23599
2      42470
3      52640
4      63896
       ...
337     1324
338     1075
339      873
340      233
341      216
Name: 도수(명), Length: 342, dtype: int64

In [11]:
type(sat['도수(명)'])

pandas.core.series.Series

In [12]:
(sat['도수(명)'] <20000)

0       True
1      False
2      False
3      False
4      False
       ...
337     True
338     True
339     True
340     True
341     True
Name: 도수(명), Length: 342, dtype: bool

In [13]:
# 위 논리식의 결과를 인덱스 검색에 넣으면 True인 행만 추출

In [14]:
sat[sat['도수(명)'] <20000]

     등급     과목  구분점수  도수(명)  비율(%)
0     1  국어 A형   128  13866   4.30
8     9  국어 A형  60미만  12554   3.89
9     1  국어 B형   127  12615   4.45
16    8  국어 B형    59  19943   7.03
17    9  국어 B형  59미만  10868   3.83
..   ..    ...   ...    ...    ...
337   5    한문Ⅰ    45   1324  20.92
338   6    한문Ⅰ    42   1075  16.99
339   7    한문Ⅰ    39    873  13.79
340   8    한문Ⅰ    37    233   3.68
341   9    한문Ⅰ  37미만    216   3.41

[294 rows x 5 columns]

# 예제 2-16 다중 논리식 검색

In [15]:
# and => &, or => |, not => ~

In [16]:
I_sat = ((sat['도수(명)'] <20000) & (sat['비율(%)'] <= 5.0))

In [17]:
I_sat.shape

(342,)

In [18]:
I_sat

0       True
1      False
2      False
3      False
4      False
       ...
337    False
338    False
339    False
340     True
341     True
Length: 342, dtype: bool

In [19]:
# True 갯수의 총합

In [20]:
I_sat.sum()

71

In [21]:
sat_logic = sat[I_sat]

In [22]:
sat_logic.shape

(71, 5)

In [23]:
sat_logic

     등급       과목  구분점수  도수(명)  비율(%)
0     1    국어 A형   128  13866   4.30
8     9    국어 A형  60미만  12554   3.89
9     1    국어 B형   127  12615   4.45
17    9    국어 B형  59미만  10868   3.83
18    1    수학 A형   137  19675   4.77
..   ..      ...   ...    ...    ...
323   9     아랍어Ⅰ  41미만    322   3.23
324   1  기초 베트남어    81    953   4.17
332   9  기초 베트남어  40미만    630   2.76
340   8      한문Ⅰ    37    233   3.68
341   9      한문Ⅰ  37미만    216   3.41

[71 rows x 5 columns]

# 예제 2-17 시리즈에 논리식 검색

In [24]:
sat_ser = sat['도수(명)']

In [25]:
sat_ser

0      13866
1      23599
2      42470
3      52640
4      63896
       ...
337     1324
338     1075
339      873
340      233
341      216
Name: 도수(명), Length: 342, dtype: int64

In [26]:
# 논리 검색은 시리즈에서도 DataFrame과 마찬가지로 적용된다.

In [27]:
sat_ser[sat_ser <20000]

0      13866
8      12554
9      12615
16     19943
17     10868
       ...
337     1324
338     1075
339      873
340      233
341      216
Name: 도수(명), Length: 294, dtype: int64

In [28]:
sat_ser[sat_ser < 20000].shape

(294,)

In [29]:
sat_ser[sat_ser < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

# 예제 2-18 데이터 프레임 팬시검색

In [30]:
# 팬시 검색: 특정 레이블을 직업 리스트에 넣어서 검색하는 방식

In [31]:
import seaborn as sns

In [32]:
titanic = sns.load_dataset('titanic')

In [33]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [35]:
#필터링하고 싶은 열을 직접 리스트에 입력

In [36]:
titanic[ ['age','sex','alive']].head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [37]:
titanic[ ['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [38]:
# 팬시 검색을 하면 하나의 열도 데이터 프레임으로 반환

In [39]:
titanic[ ['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [40]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [41]:
#검색에 열 문자열만 입력하면 시리즈로 반환

In [42]:
type(titanic['age'])

pandas.core.series.Series

# 예제 2-19 시리즈 팬시검색

In [43]:
titanic_age = titanic['age']

In [44]:
titanic_age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [45]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64

# 예제 2-20 명시적 인덱서 검색

In [46]:
diamonds = sns.load_dataset('diamonds')

In [47]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [48]:
diamonds.shape

(53940, 10)

In [49]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [50]:
type(diamonds.loc)

pandas.core.indexing._LocIndexer

In [51]:
# loc[행검색조건, 열 검색조건]

In [52]:
diamonds.loc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table       55.0
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [53]:
diamonds.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [54]:
diamonds.loc[0,'carat']

0.23

In [55]:
diamonds.loc[:,'carat']

0        0.23
1        0.21
2        0.23
3        0.29
4        0.31
         ...
53935    0.72
53936    0.72
53937    0.70
53938    0.86
53939    0.75
Name: carat, Length: 53940, dtype: float64

In [56]:
diamonds['carat']

0        0.23
1        0.21
2        0.23
3        0.29
4        0.31
         ...
53935    0.72
53936    0.72
53937    0.70
53938    0.86
53939    0.75
Name: carat, Length: 53940, dtype: float64

In [57]:
# 팬시 검색을 통해 데이터 프레임으로 반환

In [58]:
diamonds.loc[:,['carat']]

       carat
0       0.23
1       0.21
2       0.23
3       0.29
4       0.31
...      ...
53935   0.72
53936   0.72
53937   0.70
53938   0.86
53939   0.75

[53940 rows x 1 columns]

In [59]:
# 팬시 검색은 열 검색 조건임

In [60]:
diamonds[['carat']]

       carat
0       0.23
1       0.21
2       0.23
3       0.29
4       0.31
...      ...
53935   0.72
53936   0.72
53937   0.70
53938   0.86
53939   0.75

[53940 rows x 1 columns]

In [61]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [62]:
# xs 함수를 통해 필터링 가능
# 기본 인자는 행 필터링 조건

In [63]:
diamonds.xs(0)

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table       55.0
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [64]:
diamonds.xs(1)

carat         0.21
cut        Premium
color            E
clarity        SI1
depth         59.8
table         61.0
price          326
x             3.89
y             3.84
z             2.31
Name: 1, dtype: object

In [65]:
# 열단위로 필터링 하려면 첫번째 인자에 열 이름 두번째 인자에 1 (axis = 1) 설정

In [66]:
diamonds.xs("carat",1).head()
# diamond.loc[1]과 같은 결과

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

# 예제 2-21 암묵적 인덱서 검색

In [67]:
# 인덱스가 레이블이 있다하더라도 암묵적으로 인덱스 번호로 접근
# iloc[행필터링 조건, 열필터링 조건]

In [68]:
# iloc는 행과 열의 필터링 조건을 번호로 접근하므로
# 행과 열의 위치가 바뀌면 잘못된 행과 열을 불러올 가능성이 있으므로 비추천

In [69]:
diamonds.iloc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table       55.0
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [70]:
diamonds.iloc[0,0]

0.23

In [71]:
%config Completer.use_judi = False

C:\Users\tj\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3457: UserWarning: Config option `use_judi` not recognized by `IPCompleter`.  Did you mean `use_jedi`?
  exec(code_obj, self.user_global_ns, self.user_ns)

In [72]:
diamonds.iloc[0,[0]]

carat    0.23
Name: 0, dtype: object

In [73]:
type(diamonds.iloc[0,[0]])

pandas.core.series.Series

In [74]:
diamonds.iloc[0,[0,1,2]]

carat     0.23
cut      Ideal
color        E
Name: 0, dtype: object

In [75]:
# 슬라이싱을 할 경우에 데이터프레임으로 반환한다

In [76]:
diamonds.iloc[:5, :3]

   carat      cut color
0   0.23    Ideal     E
1   0.21  Premium     E
2   0.23     Good     E
3   0.29  Premium     I
4   0.31     Good     J

# 예제 2-22 명시적 인덱서 복합 검색

In [77]:
# 명시적 인덱서는 레이블을 가지고 처리하는데 슬라이스,
# 논리 검색과 조합하여 다양한 검색을 처리 할 수 있다.

In [78]:
diamonds.columns

Index(['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price', 'x', 'y',
       'z'],
      dtype='object')

In [79]:
((diamonds['carat']== 0.23)& (diamonds['cut'] == 'Very Good')).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [80]:
carat_cut = diamonds.loc[((diamonds['carat'] == 0.23) & (diamonds['cut'] == 'Very Good')),
                        ['carat','cut','color','price']]

In [81]:
carat_cut

       carat        cut color  price
9       0.23  Very Good     H    338
21      0.23  Very Good     E    352
22      0.23  Very Good     H    353
25      0.23  Very Good     G    354
28      0.23  Very Good     D    357
...      ...        ...   ...    ...
50636   0.23  Very Good     F    402
50637   0.23  Very Good     F    402
50638   0.23  Very Good     F    402
50639   0.23  Very Good     F    402
52310   0.23  Very Good     D    549

[197 rows x 4 columns]

In [82]:
carat_cut.head()

    carat        cut color  price
9    0.23  Very Good     H    338
21   0.23  Very Good     E    352
22   0.23  Very Good     H    353
25   0.23  Very Good     G    354
28   0.23  Very Good     D    357

In [83]:
diamonds.loc[:,['carat','cut','color','price']].head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

# 예제 2-23 문자열 값 순서 검색

In [84]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [85]:
set_i = diamonds.set_index('color')

In [86]:
set_i.head()

       carat      cut clarity  depth  table  price     x     y     z
color
E       0.23    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
E       0.21  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
E       0.23     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
I       0.29  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
J       0.31     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [87]:
# 행의 인덱스가 정렬되어 있지 않으므로 예외 발생

In [88]:
try:
    set_i.loc['E':'F']
except ValueError as e:
    print('ValueError',e)
except KeyError as e:
    print('KeyError',e)

KeyError "Cannot get left slice bound for non-unique label: 'E'"

In [89]:
set_i

       carat        cut clarity  depth  table  price     x     y     z
color
E       0.23      Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
E       0.21    Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
E       0.23       Good     VS1   56.9   65.0    327  4.05  4.07  2.31
I       0.29    Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
J       0.31       Good     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...     ...    ...    ...    ...   ...   ...   ...
D       0.72      Ideal     SI1   60.8   57.0   2757  5.75  5.76  3.50
D       0.72       Good     SI1   63.1   55.0   2757  5.69  5.75  3.61
D       0.70  Very Good     SI1   62.8   60.0   2757  5.66  5.68  3.56
H       0.86    Premium     SI2   61.0   58.0   2757  6.15  6.12  3.74
D       0.75      Ideal     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 9 columns]

In [90]:
# 내부의 값을 변경하고자 할 때 inplace = True 인자를 세팅한다

In [91]:
set_i.sort_index(inplace = True)

In [92]:
set_i

       carat        cut clarity  depth  table  price     x     y     z
color
D       0.75      Ideal     SI2   62.2   55.0   2757  5.83  5.87  3.64
D       1.00  Very Good     SI2   63.5   59.0   4295  6.35  6.32  4.02
D       1.00       Good     SI2   57.8   58.0   4295  6.61  6.55  3.80
D       1.00  Very Good     SI2   61.5   63.0   4295  6.32  6.27  3.87
D       0.56      Ideal      IF   61.9   57.0   4293  5.28  5.31  3.28
...      ...        ...     ...    ...    ...    ...   ...   ...   ...
J       1.00    Premium     SI1   60.8   58.0   3712  6.39  6.44  3.90
J       1.52      Ideal     SI1   61.9   57.0   7491  7.37  7.33  4.55
J       1.50  Very Good     VS2   62.6   58.0   7492  7.25  7.29  4.55
J       0.65      Ideal     SI1   61.4   55.0   1276  5.58  5.62  3.44
J       1.30      Ideal     SI1   61.5   55.0   5728  7.03  7.06  4.33

[53940 rows x 9 columns]

In [93]:
try:
    set_i_str = set_i.loc['E':'F']
except ValueError as e:
    print('ValueError',e)
except KeyError as e:
    print('KeyError',e)

In [94]:
set_i_str.shape

(19339, 9)

In [95]:
set_i_str.head()

       carat        cut clarity  depth  table  price     x     y     z
color
E       2.01      Ideal     SI2   62.2   57.0  17849  8.09  8.04  5.02
E       1.51  Very Good    VVS2   60.2   61.0  17689  7.34  7.40  4.44
E       0.50      Ideal    VVS2   61.5   57.0   2236  5.09  5.12  3.14
E       1.13      Ideal    VVS1   60.6   57.0  14525  6.72  6.77  4.09
E       1.51      Ideal     VS2   62.7   57.0  14482  7.31  7.26  4.57

In [96]:
set_i_str.tail()

       carat      cut clarity  depth  table  price     x     y     z
color
F       1.01    Ideal     VS1   62.5   54.0   7602  6.46  6.43  4.03
F       1.01  Premium     VS1   62.5   58.0   7602  6.42  6.37  4.00
F       1.05    Ideal     VS2   59.1   57.0   7697  6.67  6.66  3.94
F       1.01     Good     VS2   57.3   62.0   5487  6.63  6.59  3.79
F       1.52    Ideal     SI1   62.0   54.0  12071  7.36  7.44  4.59